In [1]:
import pandas as pd
import numpy as np

# 一、2002 年-2018 年上海机动车拍照拍卖

In [51]:
df = pd.read_csv('./数据集/2002年-2018年上海机动车拍照拍卖.csv')
df.head()

,Date,Total number of license issued,lowest price,avg price,Total number of applicants
0,2-Jan,1400,13600,14735,3718
1,2-Feb,1800,13100,14057,4590
2,2-Mar,2000,14300,14662,5190
3,2-Apr,2300,16000,16334,4806
4,2-May,2350,17800,18357,4665

### (1) 哪一次拍卖的中标率首次小于 5%?

In [18]:
df['rate'] = df['Total number of license issued'] / df['Total number of applicants']
df.query('rate<0.05')['Date'].iloc[0]

'15-May'

### (2) 按年统计拍卖最低价的下列统计量:最大值、均值、0.75 分位数，要求显示在同一张表上。

In [33]:
year = [i[0] for i in df.Date.str.split('-')]
res = df.groupby(year)['lowest price '].agg(['max','mean',lambda x:x.quantile(0.75)])
res.rename(columns={res.columns[2]:'quantile75'},inplace = True)
res.head()

      max          mean  quantile75
10  44900  38008.333333       41825
11  53800  47958.333333       51000
12  68900  61108.333333       65325
13  90800  79125.000000       82550
14  74600  73816.666667       74000

### (3) 将第一列时间列拆分成两个列，一列为年份(格式为 20××)，另一列为 月份(英语缩写)，添加到列表作为第一第二列，并将原表第一列删除， 其他列依次向后顺延。

In [52]:
year = [int(i[0])+2000 for i in df.Date.str.split('-')]
mon = [i[1] for i in df.Date.str.split('-')]
df['year'],df['month'] = year,mon
df.head()

,Date,Total number of license issued,lowest price,avg price,Total number of applicants,year,month
0,2-Jan,1400,13600,14735,3718,2002,Jan
1,2-Feb,1800,13100,14057,4590,2002,Feb
2,2-Mar,2000,14300,14662,5190,2002,Mar
3,2-Apr,2300,16000,16334,4806,2002,Apr
4,2-May,2350,17800,18357,4665,2002,May

In [53]:
del df['Date']
cols = df.columns.tolist()

In [54]:
res3 = df.reindex(columns=cols[-2:]+cols[:-2])
res3.head()

,year,month,Total number of license issued,lowest price,avg price,Total number of applicants
0,2002,Jan,1400,13600,14735,3718
1,2002,Feb,1800,13100,14057,4590
2,2002,Mar,2000,14300,14662,5190
3,2002,Apr,2300,16000,16334,4806
4,2002,May,2350,17800,18357,4665

### (4) 现在将表格行索引设为多级索引，外层为年份，内层为原表格第二至第 五列的变量名，列索引为月份。

In [57]:
res3.set_index(['year']+cols[:4]).head()

                                                                                       month
year Total number of license issued lowest price  avg price Total number of applicants
2002 1400                           13600         14735     3718                         Jan
     1800                           13100         14057     4590                         Feb
     2000                           14300         14662     5190                         Mar
     2300                           16000         16334     4806                         Apr
     2350                           17800         18357     4665                         May

### (5)一般而言某个月最低价与上月最低价的差额，会与该月均值与上月均值 的差额具有相同的正负号，哪些拍卖时间不具有这个特点?

In [62]:
df.head(2)

,Total number of license issued,lowest price,avg price,Total number of applicants,year,month
0,1400,13600,14735,3718,2002,Jan
1,1800,13100,14057,4590,2002,Feb

In [64]:
tmp = df.set_index(['year','month']).iloc[:,[1,2]]
tmp.head(2)

            lowest price   avg price
year month
2002 Jan            13600      14735
     Feb            13100      14057

In [65]:
tmp.diff()

            lowest price   avg price
year month
2002 Jan              NaN        NaN
     Feb           -500.0     -678.0
     Mar           1200.0      605.0
     Apr           1700.0     1672.0
     May           1800.0     2023.0
     Jun           1800.0     1821.0
     Jul            200.0      726.0
     Aug           1200.0      697.0
     Sep           2600.0     2439.0
     Oct           2800.0     3000.0
     Nov           4400.0     4681.0
     Dec          -3000.0    -3873.0
2003 Jan          -9000.0    -3581.0
     Feb           5000.0      987.0
     Mar           5000.0     4297.0
     Apr           5300.0     5294.0
     May            900.0     2058.0
     Jun           1100.0      764.0
     Jul            800.0      602.0
     Aug           1600.0     1100.0
     Sep          -9700.0     -641.0
     Oct           4000.0    -3886.0
     Nov            300.0     -558.0
     Dec           4000.0     3770.0
2004 Jan            900.0     1462.0
     Feb           1600.0      537.0
     Mar           3400.0     3280.0
     Apr           1200.0     2159.0
     May         -33400.0   -11266.0
     Jun           7000.0   -13225.0
...                   ...        ...
2016 Jul           2800.0     2752.0
     Aug           -300.0     -289.0
     Sep           -400.0     -423.0
     Oct           1800.0     1836.0
     Nov            300.0      306.0
     Dec           -300.0     -253.0
2017 Jan           -700.0     -727.0
     Feb            600.0      555.0
     Mar           -400.0     -324.0
     Apr           2000.0     1934.0
     May            300.0      359.0
     Jun           -700.0     -677.0
     Jul           2800.0     2718.0
     Aug           -600.0     -621.0
     Sep           -300.0     -214.0
     Oct           2200.0     2125.0
     Nov           -400.0     -410.0
     Dec           -300.0     -282.0
2018 Jan          -4900.0    -4912.0
     Feb           -300.0     -276.0
     Mar            500.0      516.0
     Apr          -1200.0    -1087.0
     May           2100.0     1929.0
     Jun          -1200.0    -1118.0
     Jul            500.0      480.0
     Aug              0.0      -15.0
     Sep          -1000.0     -955.0
     Oct            700.0      660.0
     Nov           -700.0     -696.0
     Dec            100.0      134.0

[203 rows x 2 columns]